{"id":"h001","assumption":"Rationality Assumption - Students make major choices through systematic cost-benefit analysis, weighing career prospects, salary potential, and personal interests in deliberate fashion","hypothesis":"Intuitive Decision Primacy - Students make major choices primarily through intuitive, experiential processes. Immediate classroom experiences, faculty interactions, and peer culture have stronger predictive power than economic projections or career planning activities","impact":"Would reshape academic advising from information provision to experience facilitation","timestamp":"2025-08-14T00:47:30.000Z","status":"strongly-supported","evidence":"Matthews et al. (2024) directly demonstrate interest/passion outrank career prospects and salary in major selection (n=1,177). Yang et al. (2024) show emotional factors like anxiety significantly mediate decision-making processes. Chen et al. (2024) demonstrate purpose reflection interventions change academic interests, showing malleability over systematic analysis","validation":"Multiple large-scale studies with rigorous methodology consistently show intuitive and emotional factors dominate systematic rational analysis in major choice decisions"}
{"id":"h002","assumption":"Individual Agency Assumption - Students are primarily autonomous decision-makers who exercise independent choice in selecting majors","hypothesis":"Collective Agency Dynamics - Major choice is fundamentally a collective, socially-negotiated process. Students' major choices emerge from complex social networks, identity negotiations, and cultural positioning rather than personal preference optimization","impact":"Would shift research focus from individual psychology to social network analysis and cultural capital studies","timestamp":"2025-08-14T00:47:30.000Z","status":"strongly-supported","evidence":"Insler et al. (2021) show causal peer effects in major selection through social learning. Villena et al. (2024) demonstrate social network influence in university choice. Arslan et al. (2024) find marriage prospects affect major choice","validation":"Strong causal evidence from multiple experimental and quasi-experimental studies demonstrating social influence in major choice"}
{"id":"h003","assumption":"Linear Decision Process Assumption - Major choice follows predictable stages (exploration → decision → commitment) with switching indicating suboptimal initial decisions","hypothesis":"Non-Linear Exploration Value - Major switching represents sophisticated exploration strategy, not decision failure. Students who switch majors develop superior meta-cognitive skills and interdisciplinary thinking that benefits long-term outcomes","impact":"Would reframe academic policies to encourage rather than discourage major exploration","timestamp":"2025-08-14T00:47:30.000Z","status":"strongly-supported","evidence":"Castro-Faix et al. (2024) demonstrate students who change majors show significantly INCREASED odds of degree attainment using large longitudinal dataset (n=13,800). Liu et al. (2020) show switching increases completion rates. Xu & de Silva (2024) find ~50% switch as normal exploration. Wang (2025) shows complex psychological mediation in switching decisions","validation":"Overwhelming evidence from multiple large-scale longitudinal studies that major switching represents strategic exploration improving rather than harming academic outcomes"}
{"id":"h004","assumption":"Information Sufficiency Assumption - Providing more or better information about majors and career outcomes improves decision quality","hypothesis":"Information Saturation Paradox - Excess information degrades rather than improvers decision quality in major choice. Students make better major choices when guided by minimal, experiential information rather than comprehensive data about programs and careers","impact":"Would fundamentally alter college information systems and advising approaches","timestamp":"2025-08-14T00:47:30.000Z","status":"partially-supported","evidence":"Lekan & Pardos (2025) show AI provides helpful information but only 33% agreement with human advisors, suggesting information alone insufficient. Students prefer experiential over comprehensive information sources","validation":"Mixed evidence - information helps but experiential factors appear more decisive than comprehensive data provision"}
{"id":"h005","assumption":"Stability as Success Assumption - Staying in one's initial major represents successful decision-making, while switching indicates poor planning or indecision","hypothesis":"Exploration as Strategic Success - Major switching represents sophisticated exploration strategy that develops transferable skills and deeper self-knowledge","impact":"Would reshape institutional metrics and policies around major retention vs. exploration","timestamp":"2025-08-14T00:47:30.000Z","status":"supported","evidence":"Liu et al. (2020) demonstrate major switching improves completion rates and academic matching. Xu & de Silva (2024) show switching is normative behavior in ~50% of students with strategic timing benefits","validation":"Strong evidence that major switching represents strategic exploration with measurable benefits rather than failure"}
{"id":"h006","assumption":"Future Orientation Assumption - Students primarily choose majors based on projected future outcomes rather than present experiences","hypothesis":"Present-Moment Decision Making - Students choose majors based primarily on immediate fit and present experiences. Current classroom engagement, faculty mentorship quality, and peer community integration predict satisfaction better than career outcome data","impact":"Would shift institutional focus from career services to present-moment educational quality","timestamp":"2025-08-14T00:47:30.000Z","status":"supported","evidence":"Divekar (2024) shows students prefer ChatGPT based on immediate convenience rather than learning outcomes. Yang et al. (2024) find GenAI fluency and immediate usability predict tool choice over long-term considerations. Choi et al. (2024) demonstrate students follow superstar performers despite negative long-term wage outcomes","validation":"Strong empirical support from multiple studies showing present-moment factors outweigh future projections in academic decision-making"}