{"id":"insler2021","title":"Tracking the Herd with a Shotgun — Why Do Peers Influence College Major Selection?","authors":"Michael Insler, Ahmed S. Rahman, Katherine Smith","journal":"IZA Discussion Paper","year":"2021","doi":"IZA DP No. 14412","url":"https://www.iza.org/publications/dp/14412/tracking-the-herd-with-a-shotgun-why-do-peers-influence-college-major-selection","keyAssumptions":"Assumes uniform peer influence without distinguishing information-based vs socializing motivations","keyHypotheses":"Peers influence major selection primarily through social learning rather than network externalities","strengths":"Natural experiment design with random peer group assignment at USNA provides strong causal identification","weaknesses":"Military academy setting may not generalize to civilian institutions","citation":"Insler, M., Rahman, A. S., & Smith, K. (2021). Tracking the Herd with a Shotgun — Why Do Peers Influence College Major Selection? IZA Discussion Paper No. 14412.","notes":"Challenges Individual Agency Assumption - demonstrates collective decision-making through peer information sharing","addedDate":"2025-08-14T00:57:15.123Z"}
{"id":"liu2020","title":"Major Decision: The Impact of Major Switching on Academic Outcomes in Community Colleges","authors":"Vivian Yuen Ting Liu, Soumya Mishra, Elizabeth M. Kopko","journal":"Research in Higher Education","year":"2020","doi":"10.1007/s11162-020-09608-6","url":"https://ccrc.tc.columbia.edu/publications/major-switching-academic-outcomes-community-colleges.html","keyAssumptions":"Major switching represents suboptimal initial decisions and delays completion","keyHypotheses":"Major switching can represent better academic matching and strategic exploration","strengths":"Large administrative dataset with propensity score matching for causal inference","weaknesses":"Community college focus may not generalize to 4-year institutions","citation":"Liu, V. Y. T., Mishra, S., & Kopko, E. M. (2020). Major Decision: The Impact of Major Switching on Academic Outcomes in Community Colleges. Research in Higher Education.","notes":"Challenges Stability as Success Assumption - shows switching can improve outcomes through better matching","addedDate":"2025-08-14T00:57:15.124Z"}
{"id":"lekan2025","title":"AI-Augmented Advising","authors":"Kasra Lekan, Zachary A. Pardos","journal":"Journal of Learning Analytics","year":"2025","doi":"10.18608/jla.2025.8593","url":"https://learning-analytics.info/index.php/JLA/article/view/8593","keyAssumptions":"More or better information improves major selection decision quality","keyHypotheses":"AI can effectively augment human advising for major selection","strengths":"Rigorous three-phase experimental design comparing AI vs human advisor recommendations","weaknesses":"Small sample size (n=33 students) and single institution study","citation":"Lekan, K., & Pardos, Z. A. (2025). AI-Augmented Advising. Journal of Learning Analytics.","notes":"Partially challenges Information Sufficiency Assumption - AI helpful but human expertise remains critical","addedDate":"2025-08-14T00:57:15.125Z"}
{"id":"matthews2024","title":"Why Students Select their College Major: An Investigative Study","authors":"Kate N. Matthews, Diane R. Edmondson, Lucy Matthews","journal":"Academic Management Journal","year":"2024","doi":"Not specified","url":"https://digitalcommons.kennesaw.edu/amj/vol13/iss1/11/","keyAssumptions":"Students systematically weigh external factors like career prospects and salary in major selection","keyHypotheses":"Interest and passion are primary drivers over external economic factors","strengths":"Large sample size (n=1,177) from diverse undergraduate population","weaknesses":"Single institution study may limit generalizability","citation":"Matthews, K. N., Edmondson, D. R., & Matthews, L. (2024). Why Students Select their College Major: An Investigative Study. Academic Management Journal, 13(1).","notes":"Challenges Rationality Assumption - intrinsic factors outweigh systematic economic analysis","addedDate":"2025-08-14T00:57:15.126Z"}
{"id":"arslan2024","title":"Testing the effects of an unobservable factor: Do marriage prospects affect college major choice?","authors":"Hayri Alper Arslan, Brantly Callaway, Tong Li","journal":"arXiv preprint","year":"2024","doi":"arXiv:2410.19947","url":"https://arxiv.org/abs/2410.19947","keyAssumptions":"Major choices are made independently based on academic and career considerations","keyHypotheses":"Marriage prospects significantly influence college major choices","strengths":"Novel econometric methodology for testing unobservable factors with large NLSY97 dataset","weaknesses":"Marriage prospects may be endogenous to other unobserved characteristics","citation":"Arslan, H. A., Callaway, B., & Li, T. (2024). Testing the effects of an unobservable factor: Do marriage prospects affect college major choice? arXiv:2410.19947.","notes":"Challenges Individual Agency Assumption - social relationship factors influence academic decisions","addedDate":"2025-08-14T00:57:15.127Z"}
{"id":"castro-faix2024","title":"Virtues of Academic Exploration: Impact of Major Changes on Degree Completion","authors":"Moraima Castro-Faix, Kristen Hengtgen, Phillip A. Morris, Kelly E. Rapp, Christa E. Winkler, Tonghui Xu","journal":"Journal of College Orientation, Transition, and Retention","year":"2024","doi":"Not specified","url":"https://pubs.lib.umn.edu/index.php/jcotr/article/download/4904/3376/29187","keyAssumptions":"Multiple major changes represent excessive indecision and delay completion","keyHypotheses":"Students who change majors show increased odds of degree attainment","strengths":"Large longitudinal dataset (n=13,800) with rigorous statistical controls","weaknesses":"Single dataset may not generalize broadly","citation":"Castro-Faix, M., Hengtgen, K., Morris, P. A., Rapp, K. E., Winkler, C. E., & Xu, T. (2024). Virtues of Academic Exploration: Impact of Major Changes on Degree Completion. Journal of College Orientation, Transition, and Retention.","notes":"Strongly supports Non-Linear Exploration Value hypothesis - major switching improves completion outcomes","addedDate":"2025-08-14T02:28:58.456Z"}
{"id":"wang2025","title":"How perceived social support influences Chinese students' intention to change majors: a chain mediation model with moderation","authors":"Zhanning Wang","journal":"Frontiers in Psychology","year":"2025","doi":"10.3389/fpsyg.2025.1502128","url":"https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2025.1502128/full","keyAssumptions":"Social support universally reduces major switching intentions","keyHypotheses":"Social support has complex bidirectional effects on major switching intentions through psychological mediation","strengths":"Sophisticated mediation model using Social Cognitive Career Theory framework","weaknesses":"Single cultural context (China) may limit generalizability","citation":"Wang, Z. (2025). How perceived social support influences Chinese students' intention to change majors: a chain mediation model with moderation. Frontiers in Psychology.","notes":"Reveals complex social dynamics supporting Collective Agency Dynamics hypothesis","addedDate":"2025-08-14T02:28:58.457Z"}
{"id":"sylaska2024","title":"Major Choices: Students' Personal Intelligence, Considerations When Choosing a Major, and Academic Success","authors":"Kateryna Sylaska, John D. Mayer","journal":"Journal of Intelligence","year":"2024","doi":"10.3390/jintelligence12110115","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11595732/","keyAssumptions":"All students have similar capacity for self-reflection in major choice decisions","keyHypotheses":"Personal intelligence significantly influences major choice quality and satisfaction","strengths":"Novel application of personal intelligence theory to academic decision-making","weaknesses":"Need for replication across different student populations","citation":"Sylaska, K., & Mayer, J. D. (2024). Major Choices: Students' Personal Intelligence, Considerations When Choosing a Major, and Academic Success. Journal of Intelligence, 12(11), 115.","notes":"Shows individual differences in decision-making capacity, challenging uniform Individual Agency Assumption","addedDate":"2025-08-14T02:28:58.458Z"}
{"id":"chen2024","title":"Reflection on Purpose Changes Students' Academic Interests: A Scalable Intervention in an Online Course Catalog","authors":"Youjie Chen, Pranathi Iyer, Rene F. Kizilcec","journal":"arXiv preprint","year":"2024","doi":"arXiv:2412.19035","url":"https://arxiv.org/abs/2412.19035","keyAssumptions":"Academic interests are stable individual characteristics","keyHypotheses":"Purpose reflection interventions can significantly change students' academic interests","strengths":"Large randomized field experiment (n>4,000) with practical intervention","weaknesses":"Single institution study, short-term follow-up","citation":"Chen, Y., Iyer, P., & Kizilcec, R. F. (2024). Reflection on Purpose Changes Students' Academic Interests: A Scalable Intervention in an Online Course Catalog. arXiv:2412.19035.","notes":"Challenges Individual Agency and Future Orientation Assumptions - shows interests are malleable","addedDate":"2025-08-14T02:28:58.459Z"}
{"id":"yang2024","title":"The relationship between college students' indecisiveness and career decision-making: The mediating role of anxiety","authors":"Yangang Yang, Rowena Libo-on, Margen Java, Li Feng","journal":"Journal of Individual Psychology and Development","year":"2024","doi":"Not specified","url":"https://systems.enpress-publisher.com/index.php/jipd/article/view/9293","keyAssumptions":"Career decisions are made through rational individual processes unaffected by emotional states","keyHypotheses":"Anxiety partially mediates the relationship between indecisiveness and career decision-making ability","strengths":"Large sample size (n=1,072) with validated psychological measures","weaknesses":"Cross-sectional design limits causal inference","citation":"Yang, Y., Libo-on, R., Java, M., & Feng, L. (2024). The relationship between college students' indecisiveness and career decision-making: The mediating role of anxiety. Journal of Individual Psychology and Development.","notes":"Challenges Rationality and Individual Agency Assumptions by showing emotional factors influence decisions","addedDate":"2025-08-14T02:28:58.460Z"}