{"id":"exp-001-intuitive-decision","title":"Intuitive vs. Rational Decision-Making Study","assumption":"Students make major choices through systematic cost-benefit analysis","hypothesis":"Students exposed to experiential major exploration will show higher satisfaction and better academic outcomes compared to students given comprehensive rational decision-making tools","evaluationPlan":"Randomized controlled trial with 400 students split between experiential immersion (treatment) and informational advising (control). Primary outcomes: major choice satisfaction at 6-month and 2-year follow-up. Secondary outcomes: academic performance, major switching behavior, decision confidence. Statistical analysis: ANOVA with effect size calculations, longitudinal mixed-effects modeling.","implications":"Would reshape academic advising from information provision to experience facilitation. Could fundamentally change how colleges structure major exploration programs.","relatedWork":"Builds on intuitive decision-making research (Kahneman, 2011), experiential learning theory (Kolb, 1984), and challenges rational choice models in educational decisions.","milestones":"Month 1-2: IRB approval and recruitment. Month 3-6: Intervention delivery. Month 7-12: Initial outcome assessment. Month 13-30: Longitudinal follow-up.","successCriteria":"Primary: Cohen's d > 0.5 for satisfaction differences. Secondary: Lower switching rates and higher GPA maintenance in experiential group.","priority":"high","status":"proposed","notes":"Core test of first hypothesis flip. Essential foundation for challenging rationality assumptions in major choice literature.","createdDate":"2025-08-14T02:04:30.000Z"}
{"id":"exp-002-social-network","title":"Social Network Influence Manipulation","assumption":"Students are primarily autonomous decision-makers who exercise independent choice in selecting majors","hypothesis":"Students' major choices will be more strongly predicted by peer network characteristics than by individual preference assessments","evaluationPlan":"Experimental manipulation of study group composition with 300 students in groups of 6-8. Conditions: homogeneous major groups, diverse major groups, individual exploration controls. Network analysis of communication patterns and influence flows. Outcome measures: major choice alignment with group members, individual preference stability over time.","implications":"Would shift research focus from individual psychology to social network analysis and cultural capital studies. Could inform peer mentoring and community-building programs.","relatedWork":"Social network analysis in educational contexts (Coleman et al., 1966), peer influence in academic choices (Winston & Zimmerman, 2004), social identity theory applications.","milestones":"Month 1-2: Network composition and randomization. Month 3-10: Group interventions and network tracking. Month 11-12: Outcome assessment and network analysis.","successCriteria":"Primary: Correlation r > 0.4 between network composition and individual choices. Secondary: Network influence metrics predict choice better than individual preferences.","priority":"high","status":"proposed","notes":"Tests collective agency hypothesis. Methodologically innovative use of experimental network manipulation.","createdDate":"2025-08-14T02:04:30.000Z"}
{"id":"exp-003-switching-strategy","title":"Major Switching as Exploration Strategy","assumption":"Major choice follows predictable stages with switching indicating suboptimal initial decisions","hypothesis":"Students who engage in structured major exploration with switching options will demonstrate superior meta-cognitive skills and interdisciplinary thinking compared to students committed to single majors","evaluationPlan":"Longitudinal RCT with 450 students across three conditions: encouraged switching, commitment focus, standard advising control. Outcome measures: meta-cognitive awareness assessments, interdisciplinary thinking measures, creative problem-solving tasks, 3-year career satisfaction follow-up. Statistical approach: structural equation modeling for pathway analysis.","implications":"Would reframe academic policies to encourage rather than discourage major exploration. Could influence institutional retention metrics and success definitions.","relatedWork":"Meta-cognitive development research (Flavell, 1976), interdisciplinary learning benefits (Klein, 2010), career adaptability literature (Savickas, 2012).","milestones":"Month 1-6: Baseline assessments and intervention setup. Month 7-24: Academic tracking and switching support. Month 25-36: Extended skills assessment. Month 37-42: Career outcome follow-up.","successCriteria":"Primary: Effect size > 0.6 for meta-cognitive awareness in exploration group. Secondary: Superior interdisciplinary problem-solving performance. Long-term: Higher career satisfaction and adaptability.","priority":"medium","status":"proposed","notes":"Longest timeline study. Challenges fundamental assumptions about switching as failure. May face institutional resistance.","createdDate":"2025-08-14T02:04:30.000Z"}
{"id":"exp-004-information-paradox","title":"Information Saturation Paradox Test","assumption":"Providing more or better information about majors and career outcomes improves decision quality","hypothesis":"Students given minimal, curated information will make better major choices than students given comprehensive information packages","evaluationPlan":"3x3 factorial design with 360 students: information load (minimal/moderate/comprehensive) x format (text/visualizations/video). Decision quality outcomes: satisfaction, academic fit, career alignment. Process measures: decision time, confidence, regret, cognitive load during decision process. Analysis: factorial ANOVA with planned contrasts testing linear and quadratic information effects.","implications":"Would fundamentally alter college information systems and advising approaches. Could simplify rather than complicate decision support tools.","relatedWork":"Choice overload research (Iyengar & Lepper, 2000), information processing in decision-making (Payne et al., 1993), satisficing vs. optimizing behavior (Simon, 1956).","milestones":"Month 1-2: Information package development and testing. Month 3-4: Intervention delivery and decision tracking. Month 5-12: Short-term outcome assessment. Month 13-24: Long-term satisfaction follow-up.","successCriteria":"Primary: Inverse relationship between information load and decision satisfaction (β < -0.3). Secondary: Lower cognitive load and higher confidence in minimal information condition.","priority":"high","status":"proposed","notes":"Direct test of information sufficiency assumption. High practical significance for college communications and advising practices.","createdDate":"2025-08-14T02:04:30.000Z"}
{"id":"exp-005-present-moment","title":"Present-Moment vs. Future-Oriented Decision Making","assumption":"Students primarily choose majors based on projected future outcomes rather than present experiences","hypothesis":"Students guided by present-moment classroom experiences and engagement will show better long-term outcomes than students focused on future career projections","evaluationPlan":"Three-arm RCT with 320 students: present-focused decision framework, future-focused framework, balanced approach control. 4-year longitudinal tracking of academic satisfaction, major persistence, faculty relationships, and post-graduation career outcomes. Mixed-effects modeling for trajectory analysis.","implications":"Would shift institutional focus from career services to present-moment educational quality. Could redefine how colleges measure and optimize student experience.","relatedWork":"Temporal construal theory (Trope & Liberman, 2003), present bias in decision-making (O'Donoghue & Rabin, 1999), flow theory and engagement (Csikszentmihalyi, 1990).","milestones":"Month 1-3: Framework training development. Month 4-9: Major exploration with framework application. Month 10-48: Extended longitudinal follow-up. Month 49-54: Post-graduation career tracking.","successCriteria":"Primary: Effect size d > 0.5 for long-term satisfaction in present-focused group. Secondary: Better academic engagement and faculty relationships. Longitudinal: Superior post-graduation career satisfaction.","priority":"medium","status":"proposed","notes":"Longest follow-up period required. Tests final core assumption about temporal orientation in decision-making. High institutional cooperation needed.","createdDate":"2025-08-14T02:04:30.000Z"}